rails/app/controllers/data_controller.rb

  def data

	rawvegs_u = []
	length = params[:length].to_i

	while length >= 0

		rawvegs_u<<params["vegs"+length.to_s]
		length = length - 1;
	end



	if rawvegs_u

		map = {}
	  	answer = []
	  	rawvegs_u.each do |veg|
	  		veg = RawVeg.where(:name => veg).first
---
SELECT  "raw_vegs".* FROM "raw_vegs" WHERE "raw_vegs"."name" = ?  ORDER BY "raw_vegs"."id" ASC LIMIT 1  [["name", "potato"]]